Tutorial/dielectricDroplet/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
 
    root            "";
    case            "";
    instance        "";
    local           "";
 
    class           dictionary;
    object          blockMeshDict;
}
 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
 
convertToMeters 1;
 
vertices
(
(-0.5   0  0 )
(-0.5   1 -0.017455065 )
(-0.5   1  0.017455065 )
( 0     0  0 )
( 0     1 -0.017455065 )
( 0     1  0.017455065 )
( 0.5   0  0 )
( 0.5   1 -0.017455065 )
( 0.5   1  0.017455065 )
);
 
blocks
(

    //hex (0 1 2 0 3 4 5 3) (100 1 60) simpleGrading (5 1 0.2)
    hex (0 1 2 0 3 4 5 3) (50 1 30) simpleGrading (5 1 0.2)
    //hex (3 4 5 3 6 7 8 6) (100 1 60) simpleGrading (5 1 5)
    hex (3 4 5 3 6 7 8 6) (50 1 30) simpleGrading (5 1 5)
);
 
edges
(
);
 
boundary
(
     front
     { 
           type wedge;
           faces  
           (
               (0 3 4 1)
               (3 6 7 4)
           );
      }
     back
     { 
           type wedge;
           faces  
           (
               (0 2 5 3)
               (3 5 8 6)
           );
      }
     domainWall
     { 
           type patch;
           faces  
           (
               (1 4 5 2)
               (4 7 8 5)
           );
      }
     floor
     { 
           type patch;
           faces  
           (
               (0 1 2 0)
           );
      }
     top
     { 
           type patch;
           faces  
           (
               (6 7 8 6)
           );
      }
     axis
     { 
           type empty;
           faces  
           (
               (0 3 3 0)
               (3 6 6 3)
           );
      }
);
 
mergePatchPairs
(
);
