Tutorial/dielectricDroplet/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (phase1 phase2);
// Droplet
phase1
{
    transportModel  Newtonian;
    nu              nu [0 2 -1 0 0 0 0]  1;
    rho             rho [1 -3 0 0 0 0 0] 1;
}

// Ambient fluid
phase2
{
    transportModel  Newtonian;
    nu              nu [0 2 -1 0 0 0 0]  1;
    rho             rho [1 -3 0 0 0 0 0] 1;
}

sigma           sigma [ 1 0 -2 0 0 0 0 ] 1;


// ************************************************************************* //
